## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_subnet.app_subnet_primaryyyyy_vnet will be created
  + resource "azurerm_subnet" "app_subnet_primaryyyyy_vnet" {
      + address_prefixes                               = [
          + "10.4.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "app-subnet-primaryyyyy"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "akin0098-githubactions-rg"
      + virtual_network_name                           = "app-vnet-primaryyyyy"
    }

  # azurerm_virtual_network.app_vnet_primaryyyyy will be created
  + resource "azurerm_virtual_network" "app_vnet_primaryyyyy" {
      + address_space       = [
          + "10.4.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "canadacentral"
      + name                = "app-vnet-primaryyyyy"
      + resource_group_name = "akin0098-githubactions-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "production"
          + "project"     = "cst8918-lab12"
          + "role"        = "primary-network"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>